------------------------------------------------------------------------------
-- employee 테이블에서 입사일이 1990년~1999년 사이인 직원을 검색하면?
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------		
	select * from employee										
 		where hire_date >= to_date('1990-01-01', 'YYYY-MM-DD')	and hire_date <= to_date('1999-12-31', 'YYYY-MM-DD')
---------------------------------------------------------------------------------------------------		
	select * from employee										
 		where hire_date
			 between 
				(  (to_date('1990-01-01', 'YYYY-MM-DD') 
				and 
				to_date('1999-12-31', 'YYYY-MM-DD')  )
---------------------------------------------------------------------------------------------------		
	select * from employee										
 		where hire_date
			 between 
				(  (to_date('19900101', 'YYYYMMDD') 
				and 
				to_date('19991231', 'YYYYMMDD')  )
---------------------------------------------------------------------------------------------------
	select * from employee	
  where to_char(hire_date, 'YYYY') between '1990' and '1999'				
---------------------------------------------------------------------------------------------------
	select * from employee										
 		where 
		to_number(  to_char(hire_date, 'YYYY') ) between 1990 and 1999			
---------------------------------------------------------------------------------------------------		


------------------------------------------------------------------------------
-- employee 테이블에서 부서번호가 10번 또는 30번인 직원 중에 연봉이 3000 미만이고
--   입사일이 '1996-01-01' 미만 직원을 검색하면?
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------		
	select * from employee	
	where ( dep_no= 10 or dep_no= 30 )						
	and ( salary < 3000
	and  hire_date < to_date('1996-01-01', 'YYYY-MM-DD') )
---------------------------------------------------------------------------------------------------		
	select * from employee	
	where dep_no in (10, 30)								
	and ( salary < 3000 )
	and  hire_date < to_date('1996-01-01', 'YYYY-MM-DD') )
---------------------------------------------------------------------------------------------------		
	select * from employee	
	where dep_no = any (10, 30)							
	and ( salary < 3000
	and  hire_date < to_date('1996-01-01', 'YYYY-MM-DD') )
---------------------------------------------------------------------------------------------------
				 
				 
------------------------------------------------------------------------------
-- employee 테이블에서 여자 직원을 검색하면?
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------
select * from employee	where  substr(jumin_num, 7, 1) in ('2', '4') ;
---------------------------------------------------------------------------------------------------
select * from employee	where  substr(jumin_num, 7, 1) = any ('2', '4') ;
---------------------------------------------------------------------------------------------------
select * from employee where jumin_num like '______2%' or jumin_num like '______4%';
---------------------------------------------------------------------------------------------------
select * from employee where jumin_num not like '______1%' and jumin_num not like '______3%';
---------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
-- employee 테이블에서 1960년대, 1970년대 출생자 중 남자만 검색하면?
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------
select * from employee  where substr(jumin_num, 1, 1) in (6, 7) and substr(jumin_num, 7, 1) = '1';
---------------------------------------------------------------------------------------------------
select * from employee where jumin_num  like '6_____1%' or jumin_num like '7_____1%';
---------------------------------------------------------------------------------------------------
				 
------------------------------------------------------------------------------
-- 직원번호, 직원명, 소속부서명 검색?
------------------------------------------------------------------------------
	------------------------------------
	-- <오라클 inner 조인>
	------------------------------------
	select
		employee.emp_no
		, employee.emp_name
		, dept.dep_name
	from
		employee , dept			
	where
		employee.dep_no=dept.dep_no

	------------------------------------
	-- <오라클 inner 조인>
	------------------------------------

select
	e.emp_no
	, e.emp_name
	, d.dep_name

from
	employee e, dept d		
where 					
	e. dep_no = d.dep_no	


	------------------------------------
	-- <ANSI inner 조인>
	------------------------------------
	select
	e.emp_no
	, e.emp_name
	, d.dep_name
from 
	employee e inner join dept d	
on 					
	e. dep_no = d.dep_no
				 
				 
	

------------------------------------------------------------------------------
---- 고객명, 고객전화번호, 담당직원명, 담당직원직급 을 출력하면? <조건> 담당직원이 있는 고객만 출력	
------------------------------------------------------------------------------
	-------------------------------------------------------------
	-- <오라클 inner 조인>
	-------------------------------------------------------------
select
	c.cus_name	"고객명"
	, c.tel_num	"고객전화번호"
	, e.emp_name	"담당직원명"
	, e.jikup	"담당직원직급"
		
from customer c, employee e				 
where c.emp_no = e.emp_no	;			 
	-------------------------------------------------------------
	-- <ANSI inner 조인>
	-------------------------------------------------------------
select
	c.cus_name	"고객명"
	, c.tel_num	"고객전화번호"
	, e.emp_name	"담당직원명"
	, e.jikup	"담당직원직급"
		
from customer c inner join employee e		
on c.emp_no = e.emp_no			;	 
	-------------------------------------------------------------
				 
				 
------------------------------------------------------------------------------
-- 부하직원명, 부하직원직급, 직속상관명, 직속직원직급 을 출력하면? <조건> 상관이 있는 직원만 출력
------------------------------------------------------------------------------
	-------------------------------------------------------------
	--<오라클 inner 조인>				
	-------------------------------------------------------------
select 
	e1.emp_name	 "부하직원명"
	, e1.jikup	"부하직원직급"
	, e2.emp_name	"직속상관명"		
	, e2.jikup	"직속직원직급"
from 
	employee e1, employee e2
where 				
	e1.mgr_emp_no = e2.emp_no;
				 
	-------------------------------------------------------------
	--<ANSI inner 조인>
	-------------------------------------------------------------
select 
	e1.emp_name	 "부하직원명"
	, e1.jikup	"부하직원직급"
	, e2.emp_name	"직속상관명"		
	, e2.jikup	"직속직원직급"
from 
	employee e1 inner join employee e2
on e1.mgr_emp_no = e2.emp_no	;			 
				 
				 
------------------------------------------------------------------------------
-- 고객명, 고객전화번호, 담당직원명, 담당직원직급  을 출력하면?   단 10번부서의 담당직원이 있는 고객만 출력
------------------------------------------------------------------------------
	-------------------------------------------------------------
	-- <오라클 inner 조인>				
	-------------------------------------------------------------
select 
	c.cus_name	"고객명"
	, c.tel_num	"고객전화번호"
	, e.emp_name	"담당직원명"
	, e.jikup	"담당직원직급"				 
				 
from customer c, employee e
where c.emp_no = e.emp_no
and	e.dep_no = 10;
				 
				 
	-------------------------------------------------------------
	<ANSI inner 조인>
	-------------------------------------------------------------
select 
	c.cus_name	"고객명"
	, c.tel_num	"고객전화번호"
	, e.emp_name	"담당직원명"
	, e.jikup	"담당직원직급"				 
				 
from  customer c inner join employee e
on c.emp_no = e.emp_no
where e.dep_no = 10;		
				 
------------------------------------------------------------------------------				 
-- 고객명, 고객전화번호, 담당직원명, 담당직원직급  을 출력하면?  단 10번부서가 아닌 담당직원이  있는 고객만 출력				 
------------------------------------------------------------------------------
	-------------------------------------------------------------
	-- <오라클 inner 조인>				
	-------------------------------------------------------------	
select 
	c.cus_no	"고객명"
	, c.tel_num	"고객전화번호"
	, e.emp_name	"담당직원명"		
	, e.jikup	"담당직원직급"				 
from customer c, employee e
where c.emp_no = e.emp_no
and e.dep_no !=10;				 
				 
	-------------------------------------------------------------
	<ANSI inner 조인>
	-------------------------------------------------------------
select 
	c.cus_no	"고객명"
	, c.tel_num	"고객전화번호"
	, e.emp_name	"담당직원명"		
	, e.jikup	"담당직원직급"	
from customer c inner join employee e				 
on c.emp_no = e.emp_no 
and e.dep_no !=10;				 
				 
				 
				 
				 
				 
