	---------------------------------------------------------------------------------
	-- 직원번호, 직원명, 근무년차, 나이, 60세에 퇴직한다고 했을 때 퇴직일까지 남은 년도, 생일, 직급, 소속부서명,
    -- 직속상관명, 직속상관의 소속부서명 를
    -- 직급순으로 출력하시오(직급이 같을 경우엔, 생일 순으로 출력하시오.)
    ---------------------------------------------------------------------------------
    select
		e1.emp_no											"직원번호"
		, e1.emp_name										"직원명"
		, ceil( (sysdate - e1.hire_date) / 365  ) 							"근무년차"		--- ceil( (오늘 날짜 - 입사날짜)/365 )    : ceil하면 floor(( )  +1 )안 해도 됨
		------------------------------------------------------------------------------------------------------------------------------------------
		, to_number (to_char(sysdate, 'YYYY')	)							--- 오늘 년도 - 태어난 년도 +1
		 -
		to_number (
				case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end
				||substr(e1.jumin_num, 1, 2)+1
				) 										"나이"
		------------------------------------------------------------------------------------------------------------------------------------------
		, 60- ( to_number (to_char(sysdate, 'YYYY')	)							--- 오늘 년도 - 태어난 년도 +1
				 -
				to_number (
                        case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end
                        ||substr(e1.jumin_num, 1, 2)+1
                        ) )                                "퇴직일까지 남은 년도"
        ------------------------------------------------------------------------------------------------------------------------------------------
        ,     to_char (
                to_date(
                    case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end
                    ||substr(e1.jumin_num, 1, 6), 'YYYYMMDD' )
                , 'YYYY-MM-DD DY', 'NLS_DATE_LANGUAGE=Korean')        "생일"
        ------------------------------------------------------------------------------------------------------------------------------------------
        , e1.jikup                                            "직급"
        , d1.dep_name                                        "소속부서명"
        , nvl(e2.emp_name, '없음')                                        "직속상관명"
        , nvl(d2. dep_name, '없음')                                         "직속상관소속부서명"
        ------------------------------------------------------------------------------------------------------------------------------------------
         from employee e1, dept d1, employee e2, dept d2
        where
            e1.dep_no =  d1.dep_no(+)
            and e1.mgr_emp_no = e2.emp_no(+)
            and e2.dep_no = d2.dep_no(+)
        order by decode(e1.jikup, '사장', '1', '부장', '2', '과장', '3', '대리', '4', '5') asc
            , case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end ||substr(e1.jumin_num, 1, 6) asc    --- 출생년/월/일 이 들어가야 먼저 태어난 사람이 먼저 나올 수 있게 됨



	---------------------------------------------------------------------------------
	-- 직원번호, 직원명, 근무년차, 나이, 60세에 퇴직한다고 했을 때 퇴직일까지 남은 년도, 생일, 직급, 소속부서명,
    -- 직속상관명, 직속상관의 소속부서명 을 한 번에 출력하시오.
    -- 직급순으로 출력하시오(직급이 같을 경우엔, 생일 순으로 출력하시오.)
    ---------------------------------------------------------------------------------
	select e1.emp_no											"직원번호"
		, e1.emp_name										"직원명"
		, ceil( (sysdate - e1.hire_date) / 365  ) 							"근무년차"
		--------------------------------------------------------------------------------------------------------
		, to_number (to_char(sysdate, 'YYYY')	)							--- 오늘 년도 - 태어난 년도 +1
		 -
		to_number (
				case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end
				||substr(e1.jumin_num, 1, 2)+1
				) 										"나이"
		------------------------------------------------------------------------------------------------------------------------------------------
		, 60- ( to_number (to_char(sysdate, 'YYYY')	)							--- 오늘 년도 - 태어난 년도 +1
				 -
				to_number (
						case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end
						||substr(e1.jumin_num, 1, 2)+1
						) 		)						"퇴직일까지 남은 년도"
		-----------------------------------------------------------------------------------------------------------------------------------------
		, 	to_char (
				to_date(
					case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end
					||substr(e1.jumin_num, 1, 6), 'YYYYMMDD' )
				, 'YYYY-MM-DD DY', 'NLS_DATE_LANGUAGE=Korean')		"생일"
		------------------------------------------------------------------------------------------------------------------------------------------
		, e1.jikup											"직급"
		--------------------------------------------------------------------------------------------------------
		, ( select d.dep_name from dept d where  d.dep_no = e1.dep_no )			"소속부서명"
		--------------------------------------------------------------------------------------------------------
		, nvl( ( select e2.emp_name from employee e2 where e1.mgr_emp_no= e2.emp_no ), '없음') "직속상관명"
		--------------------------------------------------------------------------------------------------------
		, nvl( (select d.dep_name from employee e2 , dept d
							where  d.dep_no=e2.dep_no and  e1.mgr_emp_no= e2.emp_no ), '없음') "직속상관소속부서명"
		--------------------------------------------------------------------------------------------------------

		from employee e1
		order by decode (e1.jikup, '사장', 1, '부장', 2, '과장', 3, '대리', 4, 5) asc
			, case substr(e1.jumin_num, 7, 1) when '1' then '19' when '2' then '19' else '20' end ||substr(e1.jumin_num, 1, 6) asc
